In [3]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [2]:
s1 = Series([ 7.3, -2.5, 3.4, 1.5],    index=['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [3]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [4]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                index=['Ohio', 'Texas', 'Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [8]:
a = 36000
b = 17900
(a+b)/4

13475.0

In [9]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [10]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [11]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [12]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))

In [25]:
df1 = DataFrame(np.arange(16.).reshape((4,4)), columns=list('abcd'))

In [26]:
df1

      a     b     c     d
0   0.0   1.0   2.0   3.0
1   4.0   5.0   6.0   7.0
2   8.0   9.0  10.0  11.0
3  12.0  13.0  14.0  15.0

In [18]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [14]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [16]:
df1.add(df2, fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [21]:
df1.add(df2, fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [17]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [19]:
df1.reindex(columns = df2.columns,fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

*여기서부터 행 더하기 빼기

In [ ]:
arr = np.arange(12.).reshape((3, 4))
arr

In [39]:
arr = np.arange(16.).reshape((4,4))

In [40]:
arr[0]

array([0., 1., 2., 3.])

In [41]:
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.],
       [12., 12., 12., 12.]])

In [44]:
frame = DataFrame(np.arange(16.).reshape((4, 4)), columns=list('abde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

           a     b     d     e
Utah     0.0   1.0   2.0   3.0
Ohio     4.0   5.0   6.0   7.0
Texas    8.0   9.0  10.0  11.0
Oregon  12.0  13.0  14.0  15.0

In [45]:
series = frame.iloc[0]
series

a    0.0
b    1.0
d    2.0
e    3.0
Name: Utah, dtype: float64

In [46]:
frame - series

           a     b     d     e
Utah     0.0   0.0   0.0   0.0
Ohio     4.0   4.0   4.0   4.0
Texas    8.0   8.0   8.0   8.0
Oregon  12.0  12.0  12.0  12.0

In [47]:
series2 = Series(range(4), index=['a','b', 'e', 'f'])
series2

a    0
b    1
e    2
f    3
dtype: int64

In [48]:
frame + series2

           a     b   d     e   f
Utah     0.0   2.0 NaN   5.0 NaN
Ohio     4.0   6.0 NaN   9.0 NaN
Texas    8.0  10.0 NaN  13.0 NaN
Oregon  12.0  14.0 NaN  17.0 NaN

In [49]:
series3 = frame['d']
series3

Utah       2.0
Ohio       6.0
Texas     10.0
Oregon    14.0
Name: d, dtype: float64

In [50]:
frame

           a     b     d     e
Utah     0.0   1.0   2.0   3.0
Ohio     4.0   5.0   6.0   7.0
Texas    8.0   9.0  10.0  11.0
Oregon  12.0  13.0  14.0  15.0

In [51]:
frame.sub(series3, axis=0)

          a    b    d    e
Utah   -2.0 -1.0  0.0  1.0
Ohio   -2.0 -1.0  0.0  1.0
Texas  -2.0 -1.0  0.0  1.0
Oregon -2.0 -1.0  0.0  1.0

In [53]:
import random

In [54]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [55]:
frame = DataFrame(np.random.randn(4,4), columns=list('abde'),
                 index = ['전주','광주','서울','강남'])

In [56]:
frame

           a         b         d         e
전주  1.151784  0.592434  0.697756  0.193843
광주  1.564298 -0.150837  2.672480  0.776212
서울 -1.024837 -0.681088 -0.880290  0.906190
강남  2.376488 -0.154116  0.173187  1.696598

In [57]:
np.abs(frame)

           a         b         d         e
전주  1.151784  0.592434  0.697756  0.193843
광주  1.564298  0.150837  2.672480  0.776212
서울  1.024837  0.681088  0.880290  0.906190
강남  2.376488  0.154116  0.173187  1.696598

In [61]:
np.abs(frame).max()

a    2.376488
b    0.681088
d    2.672480
e    1.696598
dtype: float64

In [62]:
f = lambda x : x.max() - x.min()

In [63]:
frame.apply(f) # apply 적용함수

a    3.401325
b    1.273521
d    3.552770
e    1.502755
dtype: float64

In [64]:
frame.apply(f,axis=1)

전주    0.957941
광주    2.823317
서울    1.931026
강남    2.530605
dtype: float64

In [67]:
def f(x):
    return Series([x.min(),x.max()], index = ['최소값', '최대값'])
frame.apply(f)

            a         b        d         e
최소값 -1.024837 -0.681088 -0.88029  0.193843
최대값  2.376488  0.592434  2.67248  1.696598

In [81]:
# 실수값을 문자열 포맷으로 변환
format = lambda x: '%.2f' %x #소숫점 2째자리 %는 저것으로 나타내라!!
frame.applymap(format)

        a      b      d     e
전주   1.15   0.59   0.70  0.19
광주   1.56  -0.15   2.67  0.78
서울  -1.02  -0.68  -0.88  0.91
강남   2.38  -0.15   0.17  1.70

In [82]:
frame['e'].map(format)

전주    0.19
광주    0.78
서울    0.91
강남    1.70
Name: e, dtype: object

*정렬과 순위

In [84]:
odj = Series(range(4), index = ['e','a','c','d'])
odj.sort_index()

a    1
c    2
d    3
e    0
dtype: int64

In [120]:
frame = DataFrame(np.arange(8).reshape((2,4)),index = ['three','one']
                 ,columns=['d','a','z','c'])
frame.sort_index()

       d  a  z  c
one    4  5  6  7
three  0  1  2  3

In [121]:
frame.sort_index(axis=1)

       a  c  d  z
three  1  3  0  2
one    5  7  4  6

In [128]:
a = frame.sort_index(axis=1,ascending=True)
b = a.sort_index()
b
# frame.sort_index()
# frame.sort_values()

       a  c  d  z
one    5  7  4  6
three  1  3  0  2

In [94]:
frame.sort_index(axis=1, ascending=False)

       z  d  c  a
three  2  0  3  1
one    6  4  7  5

In [95]:
obj = Series([4, 7, -3, 2])
# obj.order()
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [96]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [131]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [132]:
# frame.sort_index(by='b')
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [136]:
 A = frame.sort_values(by=['a', 'b'])
 B = A.sort_index()
 C = B.sort_index(axis=1)
 C

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [100]:
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [101]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [102]:
obj.rank(method='first') #인덱스가 먼저인걸로 랭킹 먹이기

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [150]:
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [153]:
obj.rank(ascending = True, method='first') #dense는 min과 동일
#          , method = 'first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [144]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 
                   'a': [0, 1, 0, 1],
                   'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [147]:
frame.rank(axis=1)

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [154]:
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [164]:
obj = Series(range(6), index = ['1','1','1','1','2','3'])

In [165]:
obj.index.is_unique

False

In [166]:
obj['1']

1    0
1    1
1    2
1    3
dtype: int64

In [155]:
obj.index.is_unique

False

In [156]:
obj['a']

a    0
a    1
dtype: int64

In [157]:
obj['c']

4

In [4]:
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a  0.212456 -0.905644 -0.005885
a -1.273722 -0.414105  2.109785
b  0.521617 -1.169368  1.322033
b -1.239639  3.117805  1.301171

In [159]:
df.loc['b']

          0         1         2
b  0.063480  0.949670 -0.459976
b  1.256665  1.199605  0.025408

In [5]:
df.iloc[0,1:]

1   -0.905644
2   -0.005885
Name: a, dtype: float64